#coding=utf-8

dict = {'A01':'京','A02':'津','A03':'沪','B02':'蒙',
        'S01':'皖','S02':'闽','S03':'粤','S04':'甘',
        'S05': '贵', 'S06': '鄂', 'S07': '冀', 'S08': '黑', 'S09': '湘',
        'S10': '豫', 'S12': '吉', 'S13': '苏', 'S14': '赣', 'S15': '辽',
        'S17': '川', 'S18': '鲁', 'S22': '浙',
        'S30':'渝', 'S31':'晋', 'S32':'桂', 'S33':'琼', 'S34':'云', 'S35':'藏',
        'S36':'陕','S37':'青', 'S38':'宁', 'S39':'新',
        'S40':'警', 'S41': '港', 'S42': '澳'}

CHARS='1234567890QWERTYUPASDFGHJKLZXCVBNM京鄂津湘冀粤晋桂蒙琼辽渝吉川黑贵沪云苏藏浙陕皖甘闽青赣宁鲁新豫警港澳使领学试挂-'

CHARS_DICT = {char:i for i, char in enumerate(CHARS)}

NUM_CHARS = len(CHARS)

#CHARS = ['京', '沪', '津', '渝', '冀', '晋', '蒙', '辽', '吉', '黑',
#         '苏', '浙', '皖', '闽', '赣', '鲁', '豫', '鄂', '湘', '粤',
#         '桂', '琼', '川', '贵', '云', '藏', '陕', '甘', '青', '宁',
#         '新', '警', '港', '澳',
#         '0', '1', '2', '3', '4', '5', '6', '7', '8', '9',
#         'A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'J', 'K',
#         'L', 'M', 'N', 'P', 'Q', 'R', 'S', 'T', 'U', 'V',
#         'W', 'X', 'Y', 'Z','_'
#         ]
